Назовём точку в пространстве «хорошей», если она находится 
строго внутри куба объёма 8 с центром в начале координат и 
рёбрами, параллельными координатным осям, но строго вне 
куба единичного объёма с центром в начале координат и рёбрами,
параллельными координатным осям. Модифицируйте эталонный 
проект таким образом, чтобы определялась и печаталась 
следующая характеристика полиэдра: сумма площадей проекций 
граней, хотя бы одна вершина которых — «хорошая» точка.


Все рёбра делятся на три класса: полностью видимые, видимые 
частично и полностью невидимые. Модифицируйте эталонный проект 
таким образом, чтобы определялась и печаталась следующая 
характеристика полиэдра: сумма длин невидимых частей частично видимых 
рёбер, центр которых находится строго внутри сферы x^2 + y^2 + z^2 = 4.




Назовём точку в пространстве «хорошей», если она находится строго внутри 
сферы  R=2, но строго вне сферы R=1. Модифицируйте эталонный проект таким 
образом, чтобы определялась и печаталась следующая характеристика полиэдра: 
сумма площадей граней, центр и хотя бы одна вершина которых — «хорошие» точки.